Diploma_proba/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;                // Версія синтаксису OpenFOAM
    format      ascii;              // Формат файлу налаштувань (текстовий)
    class       dictionary;         // Клас об'єкта
    object      controlDict;        // Назва даного словника
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Назва вирішувача (солвера), який виконує симуляцію двофазного потоку
application     driftFluxFoam;

// З якого моменту починати розрахунок (startTime — з вказаного часу нижче)
startFrom       startTime;

// Початковий час симуляції (0 секунд)
startTime       0;

// Умова зупинки симуляції (endTime — коли час досягне значення endTime)
stopAt          endTime;

// Кінцевий час симуляції у секундах.
// Фізичний час симуляції T = step_max * tau = 30000 * 5e-5 = 1.5 секунди.
endTime         2;

// Початковий крок за часом
deltaT          0.0001;

// Режим збереження результатів:
// adjustable / timeStep / runTime (зараз збереження зав'язане на часові інтервали або кроки)
writeControl    adjustable;

// Інтервал збереження файлів результатів.
writeInterval   0.01;

// Скільки останніх збережених моментів часу зберігати на диску
// 0 означає зберігати абсолютно всі часові папки (без видалення старих)
purgeWrite      0;

// Формат запису розрахованих полів (U, p, alpha) на диск
// ascii — текстовий читабельний формат; binary — бінарний (швидший і займає менше місця)
writeFormat     binary;

// Точність запису чисел у текстовому форматі (кількість знаків після коми)
writePrecision  6;

// Стиснення вихідних файлів у .gz (off — вимкнено)
writeCompression off;

// Формат відображення часу в назвах папок результатів
timeFormat      general;

// Точність відображення часу в назвах папок
timePrecision   6;

// Чи дозволено змінювати цей файл без зупинки симуляції (yes — так, OpenFOAM перечитає зміни під час роботи)
runTimeModifiable yes;

// Автоматичне підлаштування кроку за часом deltaT за числом Куранта (off — фіксований крок tau=5e-5)
adjustTimeStep  on;

// Максимально припустиме число Куранта (Co) для забезпечення чисельної стабільності
maxCo           0.8;

// Максимально можливе значення кроку за часом deltaT при автоматичному підлаштуванні
maxDeltaT       0.001;


// ************************************************************************* //
