Diploma_proba/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;            // Версія синтаксису файлу
    format      ascii;          // Формат кодування (текстовий ASCII)
    class       dictionary;     // Клас об'єкта (словник налаштувань)
    object      blockMeshDict;  // Назва даного словника
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Масштаб геометричних координат
// 1 = метри (значення у vertices залишаються без змін)
scale   1;

// 1. КООРДИНАТИ ВЕРШИН (Точки кутів нашого 3D-паралелепіпеда: (X Y Z))
// Х — довжина (0..1.0 м), Y — висота (0..0.1 м), Z — товщина каналу (0..0.1 м)
vertices
(
    (0 0 0)             // Точка 0: Нижній-лівий кут (передня грань)
    (0.5 0 0)           // Точка 1: Нижній-правий кут (передня грань)
    (0.5 0.085 0)         // Точка 2: Верхній-правий кут (передня грань)
    (0 0.085 0)           // Точка 3: Верхній-лівий кут (передня грань)
    (0 0 0.16)           // Точка 4: Нижній-лівий кут (задня грань)
    (0.5 0 0.16)         // Точка 5: Нижній-правий кут (задня грань)
    (0.5 0.085 0.16)       // Точка 6: Верхній-правий кут (задня грань)
    (0 0.085 0.16)         // Точка 7: Верхній-лівий кут (задня грань)
);

// 2. ОПИС БЛОКІВ ТА СІТКИ
blocks
(
    // hex — геометричний об'єм з 8 вершин у строгому порядку обходу
    // (0 1 2 3 4 5 6 7) — індекси вершин із блоку vertices
    // (400 40 1) — кількість комірок за осями (Nx Ny Nz):
    //    400 комірок по Х (уздовж довжини L)
    //    40 комірок по Y (уздовж висоти H)
    //    1 комірка по Z (для 2D симуляції)
    // simpleGrading (1 1 1) — рівномірний крок сітки без згущення (коефіцієнт 1)
    hex (0 1 2 3 4 5 6 7) (200 34 1) simpleGrading (1 1 1)
);

// 3. ВИГНУТІ РЕБРА (Залишаємо порожнім)
edges
(
);

// 4. ГРАНИЧНІ УМОВИ (Визначення зовнішніх граней/патчів для надання їм фізичних властивостей)
boundary
(
    // Ліва стінка
    inlet
    {
        type patch;             // Фізичний тип "вхід/вихід" (patch)
        faces
        (
            (0 4 7 3)           // Грань при X = 0.0 (обхід точок за годинниковою/проти)
        );
    }
    // Права стінка
    outlet
    {
        type patch;             // Фізичний тип "вхід/вихід" (patch)
        faces
        (
            (1 2 6 5)           // Грань при X = 1.0
        );
    }
    // Дно каналу
    bottomWall
    {
        type patch;              // Або wall, якщо буде суворе прилипання. Для slip краще patch.
        faces
        (
            (0 1 5 4)           // Нижній плоский прямокутник при Y = 0.0
        );
    }
    // Стеля каналу
    top
    {
        type patch;             // Патч для верхньої межі
        faces
        (
            (3 7 6 2)           // Верхній плоский прямокутник при Y = 0.1
        );
    }
    // Передня та задня площини (для 2D розрахунку)
    frontAndBack
    {
        type empty;             // Спеціальний тип OpenFOAM: ігнорує розрахунок вздовж осі Z
        faces
        (
            (0 3 2 1)           // Передня площина (Z = 0.0)
            (4 5 6 7)           // Задня площина (Z = 0.1)
        );
    }
);

// 5. ЗШИВАННЯ ПАТЧІВ (Використовується лише для складних складених сіток, тут порожньо)
mergePatchPairs
(
);


// ************************************************************************* //
