Diploma_proba/system/createPatchDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      createPatchDict;
}

pointSync false;

patches
(
    {
        name nozzles;
        patchInfo { type patch; }
        constructFrom set;
        set nozzleFaces;
    }
    {
        name sludgeInlet;
        patchInfo { type patch; }
        constructFrom set;
        set sludgeInletFaces;
    }
);
