Diploma_proba/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (sludge water);

sludge
{
    transportModel  BinghamPlastic;

    "(plastic|BinghamPlastic)Coeffs"
    {
        coeff       0.00023143;
        exponent    0;

        BinghamCoeff    0;
        BinghamExponent 0;
        BinghamOffset   0;

        muMax       10;
    }

    rho         7800;
}

water
{
    transportModel  Newtonian;

    nu              1.004e-04;
    rho             1000;
}

relativeVelocityModel simple;

"(simple|general)Coeffs"
{
    V0              (0 -0.03695 0);
    a               0;
    a1              0;
    residualAlpha   0;
}


// ************************************************************************* //
