Diploma_proba/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.4228 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (0.4228 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           $internalField;
    }

    bottomWall
    {
        type            slip;
    }

    nozzles
    {
        type            fixedValue;
        value           uniform (0 0.3993 0);
    }
    
    sludgeInlet
    {
        type            fixedValue;
        value           uniform (0 -0.1 0);
    }

    top
    {
        type            slip;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
