Diploma_proba/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;                // Версія синтаксису OpenFOAM
    format      ascii;              // Формат файлу налаштувань (текстовий)
    class       dictionary;         // Клас об'єкта
    object      fvSchemes;          // Назва даного словника
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// 1. СХЕМИ ДИСКРЕТИЗАЦІЇ ПОХІДНОЇ ЗА ЧАСОМ (∂/∂t)
ddtSchemes
{
    // Euler — неявна схема Ейлера першого порядку точності за часом (проста, дуже стабільна).
    default         Euler;
}

// 2. СХЕМИ ДИСКРЕТИЗАЦІЇ ГРАДІЄНТІВ (∇p, ∇U тощо)
gradSchemes
{
    // Gauss linear — метод Гаусса з лінійною інтерполяцією (центрально-різницева схема 2-го порядку точності).
    default         Gauss linear;
}

// 3. СХЕМИ ДИСКРЕТИЗАЦІЇ ДИВЕРГЕНЦІЇ / КОНВЕКТИВНИХ ЧЛЕНІВ (∇·(ρUU), ∇·(Uα))
divSchemes
{
    default             none;

    // Схема для конвекції імпульсу (швидкості U):
    // linearUpwind — протипотічна схема 2-го порядку (забезпечує високу точність і стабільність)
    div(rhoPhi,U)       Gauss linearUpwind grad(U);

    // В'язкі та додаткові напруження
    div(tauDm)          Gauss linear;

    // Перенос концентрації фази (alpha / beta у Python):
    // vanLeer — спеціальна обмежувальна схема (High Resolution Scheme),
    // яка утримує межу фаз різкою і не дає концентрації виходити за межі [0, 1]
    "div\(phi,alpha.*\)" Gauss vanLeer;

    // Відносна швидкість/дрейф фаз
    "div\(phirb,alpha.*\)" Gauss linear;

    // Турбулентні характеристики (якщо увімкнена турбулентність)
    div(rhoPhi,k)       Gauss limitedLinear 1;
    div(rhoPhi,epsilon) Gauss limitedLinear 1;

    // Дивергенція тензора в'язких напружень
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

// 4. СХЕМИ ДИСКРЕТИЗАЦІЇ ЛАПЛАСІАНІВ / ДИФУЗІЇ (∇·(ν∇U), ∇²p)
laplacianSchemes
{
    // Gauss linear corrected — класичний оператор Лапласа 2-го порядку
    // з поправкою на неортогональність сітки
    default         Gauss linear corrected;
}

// 5. СХЕМИ ІНТЕРПОЛЯЦІЇ З ЦЕНТРІВ КОМІРОК НА ГРАНІ
interpolationSchemes
{
    // linear — звичайна лінійна інтерполяція (центрально-різницева)
    default         linear;
}

// 6. СХЕМИ ДЛЯ НОРМАЛЬНИХ СКЛАДОВИХ ГРАДІЄНТА НА ГРАНЯХ КОМІРОК
snGradSchemes
{
    // corrected — схема з поправкою на косинуси кутів між комірками
    default         corrected;
}


// ************************************************************************* //
