Diploma_proba/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;                // Версія синтаксису OpenFOAM
    format      ascii;              // Формат файлу налаштувань (текстовий)
    class       dictionary;         // Клас об'єкта
    object      fvSolution;         // Назва даного словника
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    // 1. РОЗВ'ЯЗУВАЧ ДЛЯ КОНЦЕНТРАЦІЇ ФАЗИ (alpha / beta)
    "alpha.*"
    {
        nAlphaCorr      2;                  // Кількість корекцій для фази
        nAlphaSubCycles 1;                  // Кількість підкроків за часом для обчислення фази

        MULESCorr       yes;                // Алгоритм MULES (гарантує, що 0 <= alpha <= 1)
        nLimiterIter    3;                  // Ітерації обмежувача
        alphaApplyPrevCorr  no;

        solver          smoothSolver;       // Розв'язувач із згладжуванням
        smoother        symGaussSeidel;     // Метод Симетричного Гаусса-Зейделя
        tolerance       1e-6;               // Абсолютна похибка (як atol у PETSc)
        relTol          0;                  // Відносна похибка (relTol = 0 змушує рахувати до tolerance)
        minIter         1;
    }

    // 2. ДИФУЗІЯ ФАЗИ
    "alpha.*Diffusion"
    {
        solver          PCG;                // Метод спряжених градієнтів (Preconditioned Conjugate Gradient)
        preconditioner  DIC;                // Прекондиціонер DIC
        tolerance       1e-6;               // Точність
        relTol          0;
        minIter         1;
    }

    // 3. РІВНЯННЯ ТИСКУ (p_rgh)
    p_rgh
    {
        solver          GAMG;               // Геометричний багатосітковий метод (один із найшвидших для тиску!)
        tolerance       1e-7;               // Точність розв'язання тиску
        relTol          0.01;               // Відносна точність між ітераціями
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }

    // Остаточна ітерація тиску в межах часового кроку
    p_rghFinal
    {
        $p_rgh;
        relTol          0;                  // На фінальному кроці доводимо до абсолютної точності 1e-10
    }

    // 4. РІВНЯННЯ ШВИДКОСТІ U ТА ТУРБУЛЕНТНОСТІ
    "(U|k|epsilon)"
    {
        solver          PBiCGStab;          // Стабілізований метод біспряжених градієнтів (дуже схожий на PETSc KSP)
        preconditioner  DILU;               // Прекондиціонер DILU
        tolerance       1e-7;               // Точність розв'язання швидкості
        relTol          0.1;
        minIter         1;
    }

    // Остаточна ітерація для швидкості
    "(U|k|epsilon)Final"
    {
        $k;
        relTol          0;
    }
}

// 5. АЛГОРИТМ ЗВ'ЯЗКУ ТИСКУ ТА ШВИДКОСТІ (PIMPLE = PISO + SIMPLE)
PIMPLE
{
    momentumPredictor no;                   // Чи робити попередній розрахунок імпульсу
    nCorrectors     3;                      // Кількість корекцій тиску (ітерації PISO)
    nNonOrthogonalCorrectors 0;             // Поправка на неортогональність (для нашої структурованої сітки = 0)
}

// 6. ФАКТОРИ РЕЛАКСАЦІЇ (підвищують стабільність)
relaxationFactors
{
    equations
    {
        ".*"           1;                   // 1 = без нижньої релаксації (чистий нестаціонарний розрахунок)
    }
}


// ************************************************************************* //
