Diploma_proba/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

sludgeInjection
{
    type            scalarSemiImplicitSource;
    active          yes;

    selectionMode   cellSet;
    cellSet         sludgeCells;
    
    volumeMode      absolute;

    injectionRateSuSp
    {
        alpha.sludge    (0.001 0);
    }
}

// ************************************************************************* //
