Diploma_proba/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.sludge 0
);

regions
(
    boxToCell
    {
        box (0 0.075 -1) (0.02 0.085 1);
        fieldValues
        (
            volScalarFieldValue alpha.sludge 0.001
        );
    }
);
